{"content": "The reason that the Java platform doesn't offer one general implementation of event-driven programming is linked to the origins of the support that the platform does offer. Back in 1996 the Java programming language was just getting started in the world and was still trying to gain a foothold and conquer a place for itself in software development. Part of this early development concentrated on software development tooling like IDEs. One of the trends in software development around that time was for reusable software components geared towards user interfaces: components that would encapsulate some sort of interesting, reusable functionality into a single package that could be handled as a single entity rather than as a loose collection of individual classes. Sun Microsystems tried to get on the component bandwagon by introducing what they called a JavaBean, a software component not only geared towards the UI but that could also be configured easily from an IDE. In order to make this happen Sun came up with a large specification of JavaBeans (the JavaBeans Spec) dealing mostly with naming conventions (to make the components easy to handle from an IDE). But Sun also realized at the same time that a UI-centric component would need support for an event-driven way of connecting events in the component to business logic that would have to be written by the individual developer. So the JavaBeans Spec also included a small specification for an event Model for the Java platform.\n", "stemmed": "the reason java platform n't offer one gener implement event-driven program link origin support platform offer . back 1996 java program languag get start world still tri gain foothold conquer place softwar develop . part earli develop concentr softwar develop tool like ide . one trend softwar develop around time reusabl softwar compon gear toward user interfac : compon would encapsul sort interest , reusabl function singl packag could handl singl entiti rather loos collect individu class . sun microsystem tri get compon bandwagon introduc call javabean , softwar compon gear toward UI could also configur easili ide . In order make happen sun came larg specif javabean ( javabean spec ) deal mostli name convent ( make compon easi handl ide ) . but sun also realiz time ui-centr compon would need support event-driven way connect event compon busi logic would written individu develop . So javabean spec also includ small specif event model java platform .", "link": "https://en.wikibooks.org/wiki/Java_Programming/Event_Handling"}